<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
	"http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
	<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en" lang="en">
<head>
	<!-- ——————————————————————————————————————————————————————————————————— TITLE -->
	<title>CANDEO | Gefahrenkataster der Uni Bern</title>
	<!-- ——————————————————————————————————————————————————————————————————— META -->
	<meta http-equiv="Content-Type"	content="text/html; charset=utf-8"/>
	<meta http-equiv="Content-Language"	content="de-de" />
	<meta http-equiv="imagetoolbar"	content="no" />
	<meta name="Robots"	content="ALL" />
	<meta name="Keywords"	content="Candeo, Gefahrenkataster, Risikomanagement, Bachelor, Interaction Design, IxD, Benjamin Wiederkehr, Christian Siegrist" />
	<meta name="Description"	content="Candeo ist die Abschlussarbeit von Benjamin Wiederkehr und Christian Siegrist. Die Arbeit entstand am Department f&uuml;r Design der Z&uuml;rcher Hochschule der K&uuml;nste (ZHDK) in der Vertiefungsrichtung Interaction Design (VIAD)." />
	<meta name="Author"	content="Benjamin Wiederkehr / Artillery.ch" />
	<meta name="Copyright"	content="2008 Benjamin Wiederkehr & Christian Siegrist" />
	<!-- ——————————————————————————————————————————————————————————————————— FAVICON -->
	<link rel="shortcut icon"	href="img/favicon.ico"	type="image/x-icon" />
	<link rel="icon"	href="img/favicon.ico"	type="image/x-icon" />
	<!-- ——————————————————————————————————————————————————————————————————— CSS -->
	<link rel="stylesheet"	href="css/base.css"	type="text/css"	media="screen" />
	<link rel="stylesheet"	href="css/print.css"	type="text/css"	media="print" />
	<link rel="stylesheet"	href="css/jquery.lightbox.css"	type="text/css"	media="screen" />
	<link rel="StyleSheet"	href="http://www.apple.com/library/quicktime/stylesheets/qtp_library.css"	type="text/css" />
	<!--[if IE 7]>
		<link rel="stylesheet"	href="css/ie7.css"	type="text/css"	media="screen" />
	<![endif]-->
	<!--[if lt IE 7]>
		<link rel="stylesheet"	href="css/ie6.css"	type="text/css"	media="screen" />
	<![endif]-->
	<!-- ——————————————————————————————————————————————————————————————————— JS -->
	<script src="js/jquery.js"	type="text/javascript"></script>
	<script src="js/jquery.localscroll.js"	type="text/javascript"></script>
	<script src="js/jquery.scrollTo.js"	type="text/javascript"></script>
	<script src="js/jquery.lightbox.js"	type="text/javascript"></script>
	<script type="text/javascript" charset="utf-8">
		$(document).ready(function() {
			$('#navigation').localScroll();
		});
	</script>
	<script src="http://www.apple.com/library/quicktime/scripts/ac_quicktime.js"	language="JavaScript"	type="text/javascript"></script>
	<script src="http://www.apple.com/library/quicktime/scripts/qtp_library.js"	language="JavaScript"	type="text/javascript"></script>
	<!-- ——————————————————————————————————————————————————————————————————— GA -->
  <script async src="https://www.googletagmanager.com/gtag/js?id=UA-3202544-12"></script>
  <script>
    window.dataLayer = window.dataLayer || [];
    function gtag(){dataLayer.push(arguments);}
    gtag('js', new Date());
    gtag('config', 'UA-3202544-12');
  </script>
</head>
	<!-- ——————————————————————————————————————————————————————————————————— BODY -->
<body>
	<div id="container">
		<div id="header">
			<h1>Candeo – Gefahrenkataster Uni Bern</h1>
		</div><!-- #header -->
		<div id="lead">
			<h3>About</h3>
			<p>Candeo ist die Abschlussarbeit von Benjamin Wiederkehr und Christian Siegrist. Die Arbeit entstand am Department f&uuml;r Design der Z&uuml;rcher Hochschule der K&uuml;nste (ZHDK) in der Vertiefungsrichtung Interaction Design (VIAD).</p>
			<h3>Impressum</h3>
			<p>&copy; 2008 <a href="http://cv.artillery.ch">Benjamin Wiederkehr</a> und <a href="http://www.significant.ch">Christian Siegrist</a></p>
			<h3>Links</h3>
			<p>
				<a href="http://candeo.artillery.ch/Blog" title="Projekt Blog der Bachelor Arbeit">Projekt Blog</a>
				<a href="http://iad.projects.zhdk.ch/bachelor08" title="Projekte der Bachelor 08 IAD Klasse">Bachelor 08</a>
				<a href="http://iad.zhdk.ch" title="Vertiefungsrichtung Interaction Design">IAD</a>
				<a href="http://www.zhdk.ch" title="Z&uuml;rcher Hochschule der K&uuml;nste">ZHDK</a>
			</p>
		</div><!-- #lead -->
		<div id="navigation">
			<ul>
				<li><a href="#abstrakt"				id="a"	title="Abstrakt">Abstrakt</a></li>
				<li><a href="#konzept"				id="k"	title="Konzept">Konzept</a></li>
				<li><a href="#visualisierung"	id="v"	title="Visualisierung">Visualisierung</a></li>
				<li><a href="#screencast	"		id="sc"	title="Screenshots">Screenshots</a></li>
				<li><a href="#screenshots"		id="ss"	title="Screenshots">Screenshots</a></li>
				<li>
					<ul class="bilder">
						<li><a href="#01"	title="Screenshot 01">Screenshot_01</a></li>
						<li><a href="#02"	title="Screenshot 02">Screenshot_02</a></li>
						<li><a href="#03"	title="Screenshot 03">Screenshot_03</a></li>
						<li><a href="#04"	title="Screenshot 04">Screenshot_04</a></li>
						<li><a href="#05"	title="Screenshot 05">Screenshot_05</a></li>
						<li><a href="#06"	title="Screenshot 06">Screenshot_06</a></li>
						<li><a href="#07"	title="Screenshot 07">Screenshot_07</a></li>
						<li><a href="#08"	title="Screenshot 08">Screenshot_08</a></li>
					</ul>
				</li>
			</ul>
		</div><!-- #navigation -->
		<div id="content">
			<div id="abstrakt" class="kapitel">
				<h2 id="a_h">Abstrakt</h2>
				<h3>Ausgangslage</h3>
				<p>Die Universit&auml;t Bern setzt sich aus 160 einzelnen Instituten zusammen, welche sich verteilt in Bern befinden. Ungef&auml;hr 35 Institute arbeiten mit Chemikalien, Mikroorganismen oder Strahlenquellen. Die Fachstelle Risikomanagment der Uni Bern ist zust&auml;dig f&uuml;r die Erfassung der Inventare aller Institute und Ermessung des resultierenden Gefahren- und Risikopotentials. Die technischen Hilfsmittel, um die Daten zu verwalten sind Excel-Tabellen und diverse Datenbanken. Bis anhin gibt es weder automatisierte Prozesse, noch Visualisierungen der Gefahren und Risiken ausgehend von der Universit&auml;t Bern.</p>
				<h3>Intention</h3>
				<p>Aufgrund der momentanen Arbeitsmethodik der Fachstelle Risikomanagement erkennen wir ein grosses Potential zur Optimierung von Arbeitsfl&uuml;ssen, Automatisierung von Datenerfassung und -visualisierung, um eine aktuelle Bestandesaufnahme der Gefahrenstoffe zu gew&auml;hrleisten und eine treffendere Bestimmung der Risikopotentiale machen zu k&ouml;nnen. Unsere Absicht ist es, mit einem umfassenden Konzept das Erkennen von Risiken komplexer Systeme und das Einleiten von sichernden Massnahmen effizienter zu gestalten, um Mensch und Umwelt von technischen Gefahren zu sch&uuml;tzen.</p>
				<h3>Ziel</h3>
				<p>Im Rahmen der Bachelor-Arbeit lautet unsere Zielsetzung, eine fundierte Analyse des Fachgebietes Risikomanagement zu erstellen, spezifischen Bed&uuml;rfnisse zu definieren, Arbeitsfl&uuml;sse zu analysieren und eine schl&uuml;ssiges und umfassendes Konzept zur Datenaufnahme, Datenverwaltung und Visualisierung zu entwickeln. Der resultierende Gefahrenkataster soll als zentrales und interaktives Werkzeug funktionieren und mittels Softwareprototyp zur Konzept&uuml;berpr&uuml;fung verwendet werden.</p>
				<p>Als weiterer Schwerpunkt setzen wir das Studium der graphischen Semiologie und der M&ouml;glichkeiten der quantitativen Darstellung, um die gewonnenen Erkentnisse auf die Informationsvisualisierung anzuwenden und ein pr&auml;gnanteres graphisches Bild zu erhalten. Durch Kombination unterschiedlicher Ansichten der Informationen und gezielten Interaktionsmodellen soll eine &uuml;bersichtliche Struktur in die komplexe Architektur gebracht werden.</p>
			</div>
			<div id="konzept" class="kapitel">
				<h2 id="k_h">Konzept</h2>
				<p>Mit Candeo k&ouml;nnen Inventare von unabh&auml;ngigen Instituten zentral verwaltet werden. Die Visualisierung von atomaren, biologischen und chemischen Gefahrenpotentialen verdeutlicht durch ihre geographische verortung die resultierende Risikokumulation.</p>
				<p>Die Uni Bern setzt sich aus 160 Instituten zusammen, wovon ungef&auml;hr 30 mit gef&auml;hrlichen Stoffen arbeiten. Die Fachstelle Risikomanagment der Uni Bern ist zust&auml;dig f&uuml;r die Erfassung dieser Inventare und Ermessung des Gefahren- und Risikopotentials.</p>
				<p>Die Daten werden momentan in tabellarischen Dokumenten gesammelt und verwaltet. Bis anhin gibt es weder automatisierte Prozesse, noch Visualisierungen der Gefahren und Risiken ausgehend von den universit&auml;ren Anlagen. Aufgrund der momentanen Arbeitsmethodik der Fachstelle besteht ein grosses Potential zur Optimierung von Arbeitsfl&uuml;ssen, Automatisierung von Datenerfassung und - visualisierung. Candeo ist ein umfassendes Konzept, welches das vorhandene Potential ausnutzt.</p>
				<p>Eintragungen in die Datenbank werden automatisiert von Candeo &uuml;bernommen, sobald ein Institut eine Bestellung get&auml;tigt oder die Entsorgungsstelle Abf&auml;lle erfasst hat. Um Korrekturen vornehmen zu k&ouml;nnen besteht alternativ die M&ouml;glichkeit der manuellen Eingabe und Bearbeitung der gespeicherten Informationen. Die Speicherung erfolgt in einer zentralisierten Datenbank. Die unterschiedlichen Datentypen sind untereinander verkn&uuml;pft und bilden ein relationales Netzwerk von unabh&auml;ngig voneinander editierbaren Knoten.</p>
				<p>In der graphischen Darstellung werden Zusammenh&auml;nge deutlich, die beim Durchsehen von tabellarisch angeordneten Daten verborgen bleiben. Zur Planung der kommenden Arbeitsschritte der Fachstelle ist ein aktualisierter Überblick der Institute und ihrer Inventare wichtig. Die eloquente Visualisierung macht das Erkennen von Risiken innerhalb des komplexen, vernetzten Systems der Universit&auml;t Bern und das Einleiten von sichernden Massnahmen effizienter und sch&uuml;tzt so Mensch und Umwelt vor technischen Gefahren.</p>
				</div>
			<div id="visualisierung" class="kapitel">
				<h2 id="v_h">Visualisierung</h2>
				<p>Die Herausforderung bei der Visualisierung bestand haupts&auml;chlich aus den unterschiedlichen Anforderungen und die optimierte Darstellung dieser. Die erw&auml;hnten Hauptaugenmerke Übersicht, Verortung, Vergleichbarkeit und Genauigkeit m&uuml;ssen in sich funktionieren, um ihre Anforderungen zu erf&uuml;llen. Wir haben in einem ersten Schritt f&uuml;r jeden Fokus eine pr&auml;zise Visualisierung ausgearbeitet. Bereits in diesem Stadium wurde die reine Visualisierung mit einem entsprechenden Interaktionsmodell angereichert. Durch Interaktion des Benutzers sollte die Qualit&auml;t der Visualisierung anhand von Lesbarkeit, Fokus und dem Kontrast von Sch&auml;rfe / Unsch&auml;rfe gesteigert werden.</p>
				<p>Eine Abhandlung der einzelnen Bereiche auf unabh&auml;ngigen Darstellungen war in der Benutzbarkeit unbefriedigend und gestaltete den Arbeitsprozess zu umst&auml;ndlich. Die Forderung nach der Kombination kam somit aus Sicht des Benutzers als auch aus unserem Anspruch nach der Weiterf&uuml;hrung bekannter und erprobter Konzepte.</p>
				<p>Das Resultat stellt eine interaktive Kombination aus Kartendarstellung und Balkendiagramm dar. F&uuml;r den Aufbau sind wir nach der Metapher von Armaturen oder Cockpit vorgegangen. Das Diagramm stellt die Information lesbar dar und die Karte verortet diese im geografischen Kontext. Bekannte Interaktionsm&ouml;glichkeiten wie Zoomen und Translozieren dienen dem Fokus und der Einstellung des Detailgrades. Interaktionen im Diagramm erweitern das Balkendiagramm um die vielschichtigen M&ouml;glichkeiten des Filterns und Erreichen von Informationen auf verschiedenen Granulationsstufen.</p>
			</div>
			<div id="screencast" class="kapitel">
				<h2 id="sc_h">Screenscast</h2>
				<script type="text/javascript"><!--
					QT_WritePoster_XHTML('Click to Play', 'img/Gesamtansicht-poster.jpg',
						'mov/Gesamtansicht.mov',
						'600', '387', '',
						'controller', 'true',
						'autoplay', 'true',
						'bgcolor', 'black',
						'scale', 'aspect');
				//-->
				</script>
				<noscript>
				<object width="600" height="387" classid="clsid:02BF25D5-8C17-4B23-BC80-D3488ABDDC6B" codebase="http://www.apple.com/qtactivex/qtplugin.cab">
					<param name="src" value="img/Gesamtansicht-poster.jpg" />
					<param name="href" value="mov/Gesamtansicht.mov" />
					<param name="target" value="myself" />
					<param name="controller" value="false" />
					<param name="autoplay" value="false" />
					<param name="scale" value="aspect" />
					<embed width="600" height="387" type="video/quicktime" pluginspage="http://www.apple.com/quicktime/download/"
						src="img/Gesamtansicht-poster.jpg"
						href="mov/Gesamtansicht.mov"
						target="myself"
						controller="false"
						autoplay="false"
						scale="aspect">
					</embed>
				</object>
				</noscript>
			</div>
			<div id="screenshots" class="kapitel">
				<h2 id="s_h">Screenshots</h2>
				<div id="01"><a href="screenshots/l/Screenshot_12.png" rel="lightbox-tour" title="Screenshot 12"><img src="screenshots/s/Screenshot_12.png" width="600" height="473" alt="Screenshot 12" /></a></div>
				<div id="02"><a href="screenshots/l/Screenshot_16.png" rel="lightbox-tour" title="Screenshot 16"><img src="screenshots/s/Screenshot_16.png" width="600" height="473" alt="Screenshot 16" /></a></div>
				<div id="03"><a href="screenshots/l/Screenshot_18.png" rel="lightbox-tour" title="Screenshot 18"><img src="screenshots/s/Screenshot_18.png" width="600" height="473" alt="Screenshot 18" /></a></div>
				<div id="04"><a href="screenshots/l/Screenshot_21.png" rel="lightbox-tour" title="Screenshot 21"><img src="screenshots/s/Screenshot_21.png" width="600" height="473" alt="Screenshot 21" /></a></div>
				<div id="05"><a href="screenshots/l/Screenshot_24.png" rel="lightbox-tour" title="Screenshot 24"><img src="screenshots/s/Screenshot_24.png" width="600" height="473" alt="Screenshot 24" /></a></div>
				<div id="06"><a href="screenshots/l/Screenshot_26.png" rel="lightbox-tour" title="Screenshot 26"><img src="screenshots/s/Screenshot_26.png" width="600" height="473" alt="Screenshot 26" /></a></div>
				<div id="07"><a href="screenshots/l/Screenshot_28.png" rel="lightbox-tour" title="Screenshot 28"><img src="screenshots/s/Screenshot_28.png" width="600" height="473" alt="Screenshot 28" /></a></div>
				<div id="08"><a href="screenshots/l/Screenshot_30.png" rel="lightbox-tour" title="Screenshot 30"><img src="screenshots/s/Screenshot_30.png" width="600" height="473" alt="Screenshot 30" /></a></div>
			</div>
		</div><!-- #content -->
	</div><!-- #container -->
	<div id="footer">
		<div></div>
	</div><!-- #footer -->
</body>
</html>
